In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[-1.15426264, -0.44634515, -0.5883472 ],
       [ 1.67685006, -0.81288757,  0.4929271 ],
       [ 0.32725834,  0.12749891,  0.89892157],
       [ 0.70282619,  0.36489107,  1.25722469]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0 -1.154263 -0.446345 -0.588347
1  1.676850 -0.812888  0.492927
2  0.327258  0.127499  0.898922
3  0.702826  0.364891  1.257225

In [7]:
dataFrame[0]

0   -1.154263
1    1.676850
2    0.327258
3    0.702826
Name: 0, dtype: float64

In [10]:
yeniDataFrame = pd.DataFrame(data,index =["Atil","Zeynep","Mehmet","Atlas"],columns = ["Maas","Yas","Calisma Saati"])

In [11]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [12]:
yeniDataFrame["Yas"]

Atil     -0.446345
Zeynep   -0.812888
Mehmet    0.127499
Atlas     0.364891
Name: Yas, dtype: float64

In [13]:
yeniDataFrame["Calisma Saati"]

Atil     -0.588347
Zeynep    0.492927
Mehmet    0.898922
Atlas     1.257225
Name: Calisma Saati, dtype: float64

In [15]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -1.154263 -0.446345
Zeynep  1.676850 -0.812888
Mehmet  0.327258  0.127499
Atlas   0.702826  0.364891

In [16]:
yeniDataFrame.loc["Atil"]   #sütun yerine satır almak istersek

Maas            -1.154263
Yas             -0.446345
Calisma Saati   -0.588347
Name: Atil, dtype: float64

In [17]:
yeniDataFrame.loc["Zeynep"]

Maas             1.676850
Yas             -0.812888
Calisma Saati    0.492927
Name: Zeynep, dtype: float64

In [19]:
yeniDataFrame.iloc[1] #index bazlı loc

Maas             1.676850
Yas             -0.812888
Calisma Saati    0.492927
Name: Zeynep, dtype: float64

In [20]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [21]:
#yeni bir column nasıl eklenir:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [22]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -1.154263 -0.446345      -0.588347       -0.892690
Zeynep  1.676850 -0.812888       0.492927       -1.625775
Mehmet  0.327258  0.127499       0.898922        0.254998
Atlas   0.702826  0.364891       1.257225        0.729782

In [24]:
yeniDataFrame.drop("Emeklilik Yasi",axis =1) #column

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [25]:
yeniDataFrame.drop("Mehmet",axis =0) #row

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -1.154263 -0.446345      -0.588347       -0.892690
Zeynep  1.676850 -0.812888       0.492927       -1.625775
Atlas   0.702826  0.364891       1.257225        0.729782

In [26]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -1.154263 -0.446345      -0.588347       -0.892690
Zeynep  1.676850 -0.812888       0.492927       -1.625775
Mehmet  0.327258  0.127499       0.898922        0.254998
Atlas   0.702826  0.364891       1.257225        0.729782

değişiklik yaptığında özellikler belirtmezsen üzerinde oynama yaptığın dataframe temelli değişikliğe uğramaz aynı kalır: inplace

In [27]:
yeniDataFrame.drop("Emeklilik Yasi",axis =1,inplace =True)

In [28]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

burda emeklilik yaşı artık dataframe den silindi

In [29]:
yeniDataFrame.loc["Atil"]["Yas"]

-0.44634515302506883

In [30]:
yeniDataFrame.loc["Atil","Yas"]

-0.44634515302506883

In [31]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [33]:
booleanFrame = yeniDataFrame < 0

In [34]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil     True   True           True
Zeynep  False   True          False
Mehmet  False  False          False
Atlas   False  False          False

In [35]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep       NaN -0.812888            NaN
Mehmet       NaN       NaN            NaN
Atlas        NaN       NaN            NaN

In [36]:
yeniDataFrame[yeniDataFrame<0]

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep       NaN -0.812888            NaN
Mehmet       NaN       NaN            NaN
Atlas        NaN       NaN            NaN

In [37]:
yeniDataFrame[yeniDataFrame["Yas"]>0]

            Maas       Yas  Calisma Saati
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [38]:
yeniDataFrame[yeniDataFrame["Calisma Saati"]>0]

            Maas       Yas  Calisma Saati
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

In [40]:
yeniDataFrame.reset_index() #indexleri resetler

    index      Maas       Yas  Calisma Saati
0    Atil -1.154263 -0.446345      -0.588347
1  Zeynep  1.676850 -0.812888       0.492927
2  Mehmet  0.327258  0.127499       0.898922
3   Atlas  0.702826  0.364891       1.257225

In [41]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -1.154263 -0.446345      -0.588347
Zeynep  1.676850 -0.812888       0.492927
Mehmet  0.327258  0.127499       0.898922
Atlas   0.702826  0.364891       1.257225

eski haline döner, yine inplace kullanmak gerekir

In [44]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [45]:
yeniDataFrame["yeni index"] = yeniIndeksListesi  #yeni index listesini column olarak ekledik

In [46]:
yeniDataFrame

            Maas       Yas  Calisma Saati yeni index
Atil   -1.154263 -0.446345      -0.588347        Ati
Zeynep  1.676850 -0.812888       0.492927        Zey
Mehmet  0.327258  0.127499       0.898922        Atl
Atlas   0.702826  0.364891       1.257225        Meh

burda sadece column olarak var, index olarak eklemek için: set index yap

In [48]:
yeniDataFrame.set_index("yeni index")

                Maas       Yas  Calisma Saati
yeni index
Ati        -1.154263 -0.446345      -0.588347
Zey         1.676850 -0.812888       0.492927
Atl         0.327258  0.127499       0.898922
Meh         0.702826  0.364891       1.257225

In [49]:
yeniDataFrame

            Maas       Yas  Calisma Saati yeni index
Atil   -1.154263 -0.446345      -0.588347        Ati
Zeynep  1.676850 -0.812888       0.492927        Zey
Mehmet  0.327258  0.127499       0.898922        Atl
Atlas   0.702826  0.364891       1.257225        Meh

In [50]:
yeniDataFrame.set_index("yeni index",inplace = True)

In [51]:
yeniDataFrame

                Maas       Yas  Calisma Saati
yeni index
Ati        -1.154263 -0.446345      -0.588347
Zey         1.676850 -0.812888       0.492927
Atl         0.327258  0.127499       0.898922
Meh         0.702826  0.364891       1.257225

## multi index

In [53]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park",]

In [54]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Keyle"]

In [55]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [56]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Keyle')]

iki indeksi birleştirdik ve tuple olarak tutar

In [57]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

multi indekse çevirdik

In [58]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',   'Keyle')],
           )

In [60]:
cizgiFilmListem = [[40,"A"],[30,"B"],[50,"C"],[9,"D"],[10,"E"],[11,"F"]]  #YAS VE MESLEK DEĞERLERİ LİSTESİ

In [64]:
cizgiFilmNumpyDizisi = np.array(cizgiFilmListem)  #numpy dizisine dönüştürdük

In [65]:
cizgiFilmNumpyDizisi

array([['40', 'A'],
       ['30', 'B'],
       ['50', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [66]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks,columns = ["Yas","Meslek"])

In [67]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    50      C
South Park Cartman   9      D
           Kenny    10      E
           Keyle    11      F

In [68]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Marge  50      C

In [69]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Keyle    11      F

In [70]:
cizgiFilmDataFrame.loc["Simpson"].loc["Bart"]

Yas       30
Meslek     B
Name: Bart, dtype: object

In [73]:
cizgiFilmDataFrame.index.names = ["Cizgi Fim","Karakter"] #indekslere isim verdik

In [74]:
cizgiFilmDataFrame

                    Yas Meslek
Cizgi Fim  Karakter
Simpson    Homer     40      A
           Bart      30      B
           Marge     50      C
South Park Cartman    9      D
           Kenny     10      E
           Keyle     11      F